Revit 2027 API
StairsPathType.DistanceToCutMark Property
 The distance from the stairs path arrow to cut mark.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DistanceToCutMark { get; set; }
Public Property DistanceToCutMark As Double
	Get
	Set
public:
property double DistanceToCutMark {
	double get ();
	void set (double value);
}
member DistanceToCutMark : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for distanceToCutMark must be between 0 and 30000 feet.
See Also
Reference
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace